вход
???- как-то проверяем, что прога еще не начата [1]
Ты ПЕРВЫЙ - ДА - иди на 222
Ты ВТОРОЙ - ДА - иди на 222
??? файл 2wate.txt есть, но старше 10мин??? - удаляем.
??? файл 2wate.txt есть
  ты - ВТОРОЙ
  иди на 222
-==-
  ты - ПЕРВЫЙ
  создать файл 2wate.txt
  иди на 222
-==-


)))222

файл есть
===ПЕРВЫЙ===
ДЕЙСТВУЙ
иди на 333 --------
===ВТОРОЙ===       |
ЖДИ                |
иди на 222         |
                   |
файла нет          |
===ВТОРОЙ===       |
ДЕЙСТВУЙ           |
иди на 333-------  |
===ПЕРВЫЙ===     | |
ЖДИ              | |
иди на 222       | |
                 | |
)))333  <----------
действие!!!
===ПЕРВЫЙ===
удалить файл
иди на 222
===ВТОРОЙ===
создать файл
иди на 222


